questionservice/load-test.yaml
config:
  target: "http://localhost:8004"
  phases:
    - duration: 60        # Ejecutar durante 60 segundos
      arrivalRate: 10     # 10 peticiones por segundo

scenarios:
  - flow:
      - post:
          url: "/api/question/generate"
          json:
            topics: ["geography"]
            lang: "es"